In [3]:
from sklearn.preprocessing import LabelEncoder
import pandas as pd
import numpy as np

ModuleNotFoundError: No module named 'sklearn'

In [3]:
data = {"Name":['Chandrahsh','Kal','Jone','Anna','Ng'],
        "Age":[None,None,22,None,25],
        "Salary":[150000,120000,None,130000,250000]}
df = pd.DataFrame(data)
# df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     2 non-null      float64
 2   Salary  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 252.0+ bytes

check missing data in present

In [4]:
df.isnull().sum()

Name      0
Age       3
Salary    1
dtype: int64

In [5]:
df.isnull().mean() *100

Name       0.0
Age       60.0
Salary    20.0
dtype: float64

### FILL MEAN VALUE IN MISSING PLACE

In [6]:
# df["Age"].fillna(df['Age'].mean(), inplace=True)
# df['Salary'].fillna(df['Salary'].mean(), inplace=True)
df.fillna({'Age':df['Age'].mean()}, inplace=True)
df.fillna({'Salary':df['Salary'].mean()}, inplace=True)

In [7]:
df.head()

         Name   Age    Salary
0  Chandrahsh  23.5  150000.0
1         Kal  23.5  120000.0
2        Jone  22.0  162500.0
3        Anna  23.5  130000.0
4          Ng  25.0  250000.0

# drop NaN ROW

In [8]:
df.dropna()

         Name   Age    Salary
0  Chandrahsh  23.5  150000.0
1         Kal  23.5  120000.0
2        Jone  22.0  162500.0
3        Anna  23.5  130000.0
4          Ng  25.0  250000.0

In [11]:
df1 = pd.read_csv("CAR_DETAILS_FROM_CAR_DEKHO.csv")
df1.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

# Encoding

### Label Encoded Data (work on two unique values)

In [ ]:
df_label = df1.copy()
le = LabelEncoder()

df_label['Transmission_Encoded'] = le.fit_transform(df_label['transmission'])

df_label[['transmission','Transmission_Encoded']].head(20)

   transmission  Transmission_Encoded
0        Manual                     1
1        Manual                     1
2        Manual                     1
3        Manual                     1
4        Manual                     1
5        Manual                     1
6        Manual                     1
7        Manual                     1
8        Manual                     1
9        Manual                     1
10       Manual                     1
11       Manual                     1
12    Automatic                     0
13       Manual                     1
14       Manual                     1
15       Manual                     1
16       Manual                     1
17       Manual                     1
18       Manual                     1
19       Manual                     1

### One-Hot Encoded(work on multiple values)

In [17]:
df_encoded = pd.get_dummies(df_label, columns=['fuel'])
df_encoded.head()

,name,year,selling_price,km_driven,seller_type,transmission,owner,Transmission_Encoded,fuel_CNG,fuel_Diesel,fuel_Electric,fuel_LPG,fuel_Petrol
0,Maruti 800 AC,2007,60000,70000,Individual,Manual,First Owner,1,False,False,False,False,True
1,Maruti Wagon R LXI Minor,2007,135000,50000,Individual,Manual,First Owner,1,False,False,False,False,True
2,Hyundai Verna 1.6 SX,2012,600000,100000,Individual,Manual,First Owner,1,False,True,False,False,False
3,Datsun RediGO T Option,2017,250000,46000,Individual,Manual,First Owner,1,False,False,False,False,True
4,Honda Amaze VX i-DTEC,2014,450000,141000,Individual,Manual,Second Owner,1,False,True,False,False,False

In [22]:
df_encoded['fuel_CNG'] = df_encoded['fuel_CNG'].astype(int)
df_encoded['fuel_Diesel'] = df_encoded['fuel_Diesel'].astype(int)
df_encoded['fuel_Electric'] = df_encoded['fuel_Electric'].astype(int)
df_encoded['fuel_LPG'] = df_encoded['fuel_LPG'].astype(int)
df_encoded['fuel_Petrol'] = df_encoded['fuel_Petrol'].astype(int)

df_encoded.head()

,name,year,selling_price,km_driven,seller_type,transmission,owner,Transmission_Encoded,fuel_CNG,fuel_Diesel,fuel_Electric,fuel_LPG,fuel_Petrol
0,Maruti 800 AC,2007,60000,70000,Individual,Manual,First Owner,1,0,0,0,0,1
1,Maruti Wagon R LXI Minor,2007,135000,50000,Individual,Manual,First Owner,1,0,0,0,0,1
2,Hyundai Verna 1.6 SX,2012,600000,100000,Individual,Manual,First Owner,1,0,1,0,0,0
3,Datsun RediGO T Option,2017,250000,46000,Individual,Manual,First Owner,1,0,0,0,0,1
4,Honda Amaze VX i-DTEC,2014,450000,141000,Individual,Manual,Second Owner,1,0,1,0,0,0

# Scaling

In [ ]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler

scaler = StandardScaler()
x_scaled = scaler.fit_transform

scaler = MinMaxScaler()
x_scaled = scaler.fit_transform()

In [28]:
import pandas as pd
from sklearn.preprocessing import StandardScaler, MinMaxScaler
from sklearn.model_selection import train_test_split

data = {"StudyHours": [1,2,3,4,5],
        "TestScore": [40,60,70,85,90]}

df = pd.DataFrame(data)

#standardScaler
standard_scaler = StandardScaler()
standard_scaler = standard_scaler.fit_transform(df)
print("Standard Scaler Output")
print(pd.DataFrame(standard_scaler, columns=['StudyHours','TestScore']))


minmax_scaler = MinMaxScaler()
minmax_scaled = minmax_scaler.fit_transform(df)

print("MinMax Scaled Output")
print(pd.DataFrame(minmax_scaled, columns=["StudyHours","TestScore"]))


x = df[["StudyHours"]]
y = df[["TestScore"]]

x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=0.2, random_state= 42)

print("Training Data")
print(x_train)

print("Test Data")
print(x_test)

print("Training Data")
print(y_train)

print("Test Data")
print(y_test)

Standard Scaler Output
   StudyHours  TestScore
0   -1.414214  -1.611111
1   -0.707107  -0.500000
2    0.000000   0.055556
3    0.707107   0.888889
4    1.414214   1.166667
MinMax Scaled Output
   StudyHours  TestScore
0        0.00        0.0
1        0.25        0.4
2        0.50        0.6
3        0.75        0.9
4        1.00        1.0
Training Data
   StudyHours
4           5
2           3
0           1
3           4
Test Data
   StudyHours
1           2
Training Data
   TestScore
4         90
2         70
0         40
3         85
Test Data
   TestScore
1         60

In [1]:
print("Hello World")

Hello World

In [2]:
print(9+6)

15